zup/ЗУП_бюджет/src/DataProcessors/ИндексацияОкладовГосударственнойСлужбы/ИндексацияОкладовГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИндексацияОкладовГосударственнойСлужбы</name>
</mdclass:DataProcessor>

zup/ЗУП_бюджет/src/Enums/ВидыИндексируемогоДенежногоСодержания/ВидыИндексируемогоДенежногоСодержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИндексируемогоДенежногоСодержания</name>
  <enumValues>
    <name>ОкладыДенежногоСодержания</name>
  </enumValues>
  <enumValues>
    <name>ОкладыПоДолжности</name>
  </enumValues>
  <enumValues>
    <name>ОкладыПоЗванию</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Documents/ИндексацияШтатногоРасписания/ИндексацияШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндексацияШтатногоРасписания</name>
  <registerRecords>InformationRegister.УдалитьИсторияИспользованияДолжностей</registerRecords>
  <registerRecords>InformationRegister.ИсторияПоказателейПоШтатномуРасписанию</registerRecords>
  <registerRecords>InformationRegister.ИсторияНачисленийПоШтатномуРасписанию</registerRecords>
  <registerRecords>InformationRegister.ИсторияИспользованияШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.УдалитьИсторияИспользованияПодразделений</registerRecords>
  <attributes>
    <name>МесяцИндексации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентИндексации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИндексацииГосударственныхСлужащих</name>
    <type>
      <types>EnumRef.ВидыИндексируемогоДенежногоСодержания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексацияВоеннослужащих</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИндексируемыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>ПозицияШтатногоРасписания</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТарифМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТарифМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТарифнаяСетка</name>
      <type>
        <types>CatalogRef.ТарифныеСетки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТарифнаяСеткаНадбавки</name>
      <type>
        <types>CatalogRef.ТарифныеСетки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьРазрядКатегорияНадбавки</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/DataProcessors/ИндексацияОкладовГосударственнойСлужбы/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ЗначенияДляЗаполнения = Новый Структура("Месяц, Организация", 
	"ДатаИндексации",
	"Организация");
			
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗарплатаКадры.ПерваяДоступнаяОрганизация();
	КонецЕсли;
	
	ВидИндексацииГосударственныхСлужащих = Перечисления.ВидыИндексируемогоДенежногоСодержания.ОкладыДенежногоСодержания;
	ИндексацияВоеннослужащих = ГосударственнаяСлужбаВызовСервера.ТолькоВоеннаяСлужба();	
	КоэффициентИндексации 	= 1;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "ДатаИндексации", "МесяцСтрокой");	
	
	УстановитьОтборСписка();
	ОбновитьИнформационныеНадписи();

КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере(Регистраторы)
	
	ПараметрыИндексации = Обработки.ИндексацияОкладовГосударственнойСлужбы.СтруктураПараметровИндексации();
	ЗаполнитьЗначенияСвойств(ПараметрыИндексации, ЭтотОбъект);	
	ПараметрыИндексации.Дата 				= ТекущаяДата();
	ПараметрыИндексации.МесяцИндексации 	= ПараметрыИндексации.ДатаИндексации;
	ПараметрыИндексации.ДатаВступленияВСилу = ПараметрыИндексации.ДатаИндексации;
	ПараметрыИндексации.Регистраторы 		= Регистраторы;
		
	ДокументыИндексаторы = Обработки.ИндексацияОкладовГосударственнойСлужбы.СоздатьДокументыИндексации(ПараметрыИндексации);
	
	Возврат ДокументыИндексаторы;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументыИндексаторы = СоздатьДокументыНаСервере(ДополнительныеПараметры.Регистраторы);

	ЭтаФорма.Элементы.ТаблицаДокументыИндексаций.Обновить();
	
	
	Для Каждого ДокументИндексатор Из ДокументыИндексаторы Цикл
		ОткрытьФормуОбъекта(ДокументИндексатор);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)

	Если Не ЗначениеЗаполнено(ДатаИндексации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не задана дата индексации.'"),
			,
			"ДатаИндексации");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не выбрана организация.'"),
			,
			"Организация");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидИндексацииГосударственныхСлужащих) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не задан вид индексации.'"),
			,
			"ВидИндексацииГосударственныхСлужащих");
		Возврат;
	КонецЕсли;
	
 	СуществующиеИндексаторы = ПолучитьИндексаторыНаДату(ДатаИндексации,Организация,ИндексацияВоеннослужащих, ВидИндексацииГосударственныхСлужащих);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Регистраторы", СуществующиеИндексаторы);
	
	Если СуществующиеИндексаторы.Количество()>0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Документы индексации будут перезаписаны. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("СоздатьДокументыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СоздатьДокументыЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииМесяцаНачисления()
	УстановитьОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияМесяцНачисленияПриИзменении()
	ПриИзмененииМесяцаНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ИндексацияВоеннослужащихПриИзменении(Элемент)
	УстановитьОтборСписка();
	ОбновитьИнформационныеНадписи();
КонецПроцедуры


#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура МесяцСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "ДатаИндексации", "МесяцСтрокой");
	ПриИзмененииМесяцаНачисления();	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("МесяцСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "ДатаИндексации", "МесяцСтрокой", , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПриИзмененииМесяцаНачисления();	
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "ДатаИндексации", "МесяцСтрокой", Направление);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцНачисленияПриИзменении", 0.3, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ТаблицаДокументыИндексацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуОбъекта(СсылкаНаОбъект, ПараметрыОткрытия = Неопределено)
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", СсылкаНаОбъект);
	КонецЕсли; 
	
	ОткрытьФорму("Документ." + ИмяОбъектаМетаданных(СсылкаНаОбъект) + ".ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяОбъектаМетаданных(Ссылка)
	
	Возврат Ссылка.Метаданные().Имя;
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформационныеНадписи()
	
	ЗаголовокФормы = "Индексация денежного содержания";
	Если ИндексацияВоеннослужащих Тогда
		ЗаголовокФормы = "Индексация денежного довольствия";
	КонецЕсли;
	
	ТолькоВоеннаяСлужба = ГосударственнаяСлужбаВызовСервера.ТолькоВоеннаяСлужба();
	Если ТолькоВоеннаяСлужба Тогда
		Элементы.ИндексацияВоеннослужащих.Видимость = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ЗаголовокФормы;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыИндексации, "Организация", Организация, ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыИндексации, "ДатаИндексации", ДатаИндексации, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыИндексации, "ИндексацияВоеннослужащих", ИндексацияВоеннослужащих, Истина);
		
	ОбновитьИнформационныеНадписи();
	                   
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексаторыНаДату(ДатаИндексации,Организация,ИндексацияВоеннослужащих, ВидИндексацииГосударственныхСлужащих)
	
	СоответствиеТиповИндексаторов = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаИндексации",ДатаИндексации);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ИндексацияВоеннослужащих",ИндексацияВоеннослужащих);
	Запрос.УстановитьПараметр("ИндексацияОкладовЗванийЧинов",ВидИндексацииГосударственныхСлужащих= Перечисления.ВидыИндексируемогоДенежногоСодержания.ОкладыДенежногоСодержания 
		ИЛИ ВидИндексацииГосударственныхСлужащих= Перечисления.ВидыИндексируемогоДенежногоСодержания.ОкладыПоЗванию);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументИндексации.Ссылка КАК Документ
	               |ИЗ
	               |	Документ.ИндексацияШтатногоРасписания КАК ДокументИндексации
	               |ГДЕ
	               |	ДокументИндексации.Организация = &Организация
	               |	И ДокументИндексации.МесяцИндексации = &ДатаИндексации
	               |	И ДокументИндексации.ИндексацияВоеннослужащих = &ИндексацияВоеннослужащих
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДокументИндексации.Ссылка
	               |ИЗ
	               |	Документ.ИндексацияЗаработка КАК ДокументИндексации
	               |ГДЕ
	               |	ДокументИндексации.Организация = &Организация
	               |	И ДокументИндексации.МесяцИндексации = &ДатаИндексации
	               |	И ДокументИндексации.ИндексацияВоеннослужащих = &ИндексацияВоеннослужащих
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДокументИндексации.Ссылка
	               |ИЗ
	               |	Документ.УтверждениеОкладовЗаВоинскиеСпециальныеЗвания КАК ДокументИндексации
	               |ГДЕ
	               |	&ИндексацияВоеннослужащих
	               |	И &ИндексацияОкладовЗванийЧинов
	               |	И ДокументИндексации.ДатаВступленияВСилу = &ДатаИндексации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДокументИндексации.Ссылка
	               |ИЗ
	               |	Документ.УтверждениеОкладовНадбавокЗаКлассныеЧины КАК ДокументИндексации
	               |ГДЕ
	               |	НЕ &ИндексацияВоеннослужащих
	               |	И &ИндексацияОкладовЗванийЧинов
	               |	И ДокументИндексации.ДатаВступленияВСилу = &ДатаИндексации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеТиповИндексаторов.Вставить(Выборка.Документ.Метаданные().Имя,Выборка.Документ);
	КонецЦикла;
	Возврат СоответствиеТиповИндексаторов;
	
КонецФункции

#КонецОбласти
